Revit 2027 API
ParameterTypeId.ViewSolarstudySunIntensityValue Property
 "Sun intensity"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudySunIntensityValue { get; }
Public Shared ReadOnly Property ViewSolarstudySunIntensityValue As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudySunIntensityValue {
	ForgeTypeId^ get ();
}
static member ViewSolarstudySunIntensityValue : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace